var ltry=[[1, 'Фонтан Дружбы народов', 'Главный фонтан и один из основных символов ВДНХ. Шестнадцать женских статуй фонтана символизируют 16 Союзных республик.', [55.829850009160864,37.631803808229506], 'Круглосуточно','5', 'https://i.pinimg.com/originals/65/a0/05/65a0053c2996b5769024691fd5afb58e.jpg', ''],
[2, 'Фонтан Каменный цветок', 'Один из трёх главных фонтанов ВДНХ. Изначальная идея показать дары природы каждой из республик не была реализована в полной мере — сделали лишь три композиции и после их «скопировали» на остальные постаменты.', [55.832165532268945,37.62800592243877], 'Круглосуточно','5', 'https://cs10.pikabu.ru/post_img/2019/06/22/9/og_og_1561217250241595249.jpg', ''],
[3, 'Макет Москвы', 'Главная отличительная особенность макета столицы — поразительная детализация зданий и максимально точное воссоздание элементов ландшафтной архитектуры. Иногда проводятся мероприятия, подробности: https://vdnh.ru/places/maket-moskvy', [55.834386404565635,37.630000043150154], ['Пн', 'Выходной', 'Вт-Вс', '10:00—20:00'],'20', 'http://1vmoskve.ru/wp-content/uploads/2017/10/Pavilon-Maketa-Moskvyi-1vmoskve.jpg', 'Бесплатно'],
[4, 'Москвариум', 'Центр океанографии и морской биологии, один из крупнейших океанариумов Европы, находится на территории ВДНХ. Иногда проводятся мероприятия, подробности: https://vdnh.ru/places/tsentr-okeanografii-i-morskoy-biologii-moskvarium/', [55.83293146791207,37.61881089569506], ['Ежедневно', '10:00—21:00'],'60', 'https://artmoskovia.ru/wp-content/uploads/2020/08/moskvarium.jpg', 'Детский билет (от 3 до 12 лет): от 750 руб. Взрослый билет: от 1100 руб. Есть льготы'],
[5, 'Театр Сказок', 'Детский интерактивный Театр сказок — это уникальное мультимедийное пространство, где каждый зритель может взаимодействовать с персонажем и влиять на сюжет сказки. Шоу рассчитано на детей от трех до десяти лет, но вызовет интерес и у взрослых. Точное расписание сеансов, уточняйте: https://vdnh.ru/places/teatr-skazok-pavilon-9-yunye-tekhniki-torf/', [55.8292098608321,37.62809694813918], ['Пн-Ср', 'Выходной','Чт-Пт', '14:00—17:00', 'Сб-Вс', '12:00—17:00'],'60', 'https://poraionu.ru/images/vdnh_03062021-1-1-05-min.jpg', 'Стандартный билет: 600 руб.При оплате картой «Мир»: скидка 20%. Есть льготы'],
[6, 'Робостанция', 'Самая масштабная интерактивная выставка достижений робототехники в России — «Робостанция» — стирает грань между технологичным настоящим и фантастическим будущим.', [55.828657307841844,37.631428251735684], ['Ежедневно','11:00-20:00'],'60', 'https://www.mos.ru/upload/newsfeed/newsfeed/vn(16889).jpg', 'Взрослый билет: от 790 руб.Льготный билет: от 490 руб.Детский билет (от 4 до 14 лет): от 590 руб.Детский билет (до 4 лет): бесплатно'],
[7, 'Россия — моя история', 'Мультимедийный образовательно-выставочный комплекс, который рассказывает о важных периодах формирования и становления государства и культуры нашей страны.', [55.83385573172871,37.626840815642716], ['Пн-Вт','Выходной','Ср-Вс', '11:00—19:30'],'90', 'https://pbs.twimg.com/media/Cqc2OYtWYAAZuWi?format=jpg&name=large', 'Входной билет: 500 руб.Есть льготы'],
[8, 'Фонтан Золотой колос', '«Золотой колос» возвышается на плоском основании, а у его подножия размещены 3 рога изобилия с овощами и фруктами: капустой, тыквой, помидорами, яблоками, виноградом и другими. Символика фонтана очевидна, потому что с древних времен колосья означали возрождение, жизнь, урожай и плодородие. ', [55.83838898626601,37.61638466354768], 'Круглосуточно','5', 'https://fs3.fotoload.ru/f/0818/1533408861/2c0840ea82.jpg', ''],
[9, 'Павильон № 34 Космос', 'Масштабная экспозиция посвящена истории достижений отечественной космической отрасли. Выставочное пространство состоит из трех разделов. «КБ-1. Космический бульвар», «КБ-2. Конструкторское бюро»,«КБ-3. Космодром будущего»', [55.835049757886544,37.621780203299494], ['Пн', 'Выходной', 'Вт-Вс', '11:00–22:00'],'60', 'https://elvik-foto.ru/images/cosmos/image1.jpeg', 'Стандартный: 500 РУБ.Стандартный при оплате картой "Мир": 400 РУБ.Есть льготы'],
[10, 'Фанерон. Город мечты', 'Она разделена на два пространства — постоянную экспозицию с футуристическими инсталляциями и лабораторию, в которой проходят воркшопы, мастер-классы, лекции и встречи с экспертами индустрии комиксов.', [55.83597052315996,37.61974708886622], ['Пн', 'Выходной', 'Вт-Вс', '11:00-22:00'],'45', 'https://sun9-70.userapi.com/sun9-15/impg/-IqUGGo4l_d5Hod5Y1muUGX9so6G2aInqi-r-Q/Tb2jycb_pbY.jpg?size=1280x650&quality=96&sign=97e2425098f132b39a9b3ea626b39f0d&c_uniq_tag=E1e8amzwLlRbwMaVs2dk79nmMsLszmbbeQX1xPy55zU&type=album', ''],
[11, 'Павильон № 58 Центр славянской письменности Слово', 'Здесь можно узнать, как развивается письменность в России и мире, какую роль она играет в жизни разных народов и как на протяжении многих веков соприкасается с устной речью. Проводятся мероприятия, подробности: https://vdnh.ru/places/tsentr-slavyanskoy-pismennosti-slovo/', [55.83268644716065,37.627130032809866], ['Пн', 'Выходной','Вт—Вс', '11:00—22:00'], '30','https://poraionu.ru/images/vdnh_03032020-00-03-min.jpg', 'Cтандартный билет: 300 руб.Стандартный билет по карте «Мир»: 240 руб.Есть льготы'],
[12, 'Музей Олимпийского движения России', 'Павильон построен в 1954 году. Основными темами в оформлении главного фасада и интерьеров стали героика разгрома немецко-фашистских войск в годы Великой Отечественной войны и возрождение сельского хозяйства. ', [55.831617222631905,37.62677250094002], 'Круглосуточно', 'https://sun9-33.userapi.com/sun9-7/impg/kc2fXm4BhuuC1xZlTrWjSoH1xxh1LZJ-F5EPtg/88MMX5DYGlY.jpg?size=807x526&quality=95&sign=a375048cc0ebc90fdba6261456cd4afb&c_uniq_tag=pcBk16MsvtQUPgUbnunHp9DlugpZnfQRqvD6Q48ViSA&type=album', ''],
[13, 'Музей Рерихов', 'Государственным музеем Востока представлена экспозиция, раскрывающая все грани художественного творчества Николая Константиновича Рериха и его сына Святослава Николаевича Рериха. Основная мысль, объединяющая выставочное пространство, и само название «Ковчег будущего» связаны с концепцией сбережения культуры — главного завета, который семья Рерихов оставила человечеству.', '[55.83067916345588,37.62756406811579]', ['Пн', 'Выходной','Вт','11:00—20:00','Ср-Чт','12:00—21:00','Пт—Вс', '11:00—20:00'],'45', 'https://um.mos.ru/upload/iblock/6f7/1.jpg', 'Стандарт: от 300. Есть льготы'],
[14, 'Павильон №36. Музей кино', 'В пространстве Музея кино на ВДНХ оборудованы три кинозала, зоны для постоянной экспозиции и тематических выставок, а также аудитории для проведения лекций по истории и теории киноискусства.', [55.8394420318957,37.616933828744756], ['Пн-Вт', '12:00—21:00','Ср', 'Выходной','Чт—Вс', '12:00—21:00'],'60', 'https://www.sunhome.ru/i/foto/7/muzei-kino-na-vdnh-2.orig.jpg', 'Входной билет: 300 руб.Льготный билет: 150 руб.'],
[15, 'Павильон № 5 Музей городского хозяйства Москвы', 'Интерактивная экспозиция в простой и увлекательной форме рассказывает, как создается и поддерживается комфортная среда для проживания в мегаполисе.', [55.82871391959448,37.62959962174149], ['Пн','Выходной','Вт—Вс','10:00—19:00'],'30', 'https://msknovosti.ru/wp-content/uploads/2022/04/5076716-1500x1000.jpg', 'Бесплатно'],
[16, 'Союзмультпарк', 'Единственный в России мультимедийный центр «Союзмультпарк» — уникальная площадка для детей и взрослых, где каждый сможет погрузиться в мир любимых мультипликационных героев, оживить их, получить новые навыки и раскрыть свои таланты.', [55.82765303999197,37.62689869536429], ['Ежедневно', '10:00—21:00'],'45', 'http://moscowalk.ru/images/2021/souzmultpark/soyuzmult_1.jpg', 'Детский билет: от 1050 руб.Взрослый билет (с 17 лет): от 550 руб.Есть льготы'],
[17, 'Московский ЛисаПарк', 'Московский ЛисаПарк – это интерактивное театральное пространство, где гости становятся участниками сказочного путешествия вместе с героями сказок – профессиональными актерами Московских театров. Московский ЛисаПарк создан лучшими театральными бутафорами России по авторской легенде о доброй семье Лис', [55.82579117428622,37.627529060421764], ['Ежедневно', '10:00—20:00'],'45', 'https://vdnh.ru/upload/iblock/404/40413b8a12794b95f173af13cdd060ae.jpg', 'Уточняйте на сайте: https://vdnh.ru/places/moskovskiy-lisapark/'],
[18, 'Музей ВДНХ', 'В Музее ВДНХ вы узнаете, кто и зачем создавал Выставку, кем были ее посетители, какие идеи были заложены на разных этапах ее развития. В этом вам помогут интерактивные инсталляции, макеты, архивная кинохроника и подлинные предметы материальной культуры.', [55.826588653528525,37.63803945454417], ['Пн', 'Выходной','Вт—Вс', '11:00—21:00'],'30', 'https://vdnh.ru/upload/resize_cache/iblock/f04/1000_1000_1/f0450665685539f2b24edef46ba58ec2.jpg', 'Входной билет: 100 руб.Есть льготы'],
[19, 'Парк интерактивных развлечений Engage VR', 'Основа парка Engage VR — это арена виртуальной реальности для командных игр с перемещением по игровому залу. Гости могут выбрать игровой мир и сценарий, надеть очки виртуальной реальности и погрузиться в игру, в которой увидят своих друзей, коллег и членов семьи игровыми персонажами и будут совместно выполнять миссии.', [55.82654939873399,37.63975606831369], ['Ежедневно', '10:00—22:00'], '60', 'Билет «Релакс», будни : от 150 руб.Билет «Релакс», выходные: от 250 руб.Билет «Все включено», будни: от 590 руб.Билет «Все включено», выходные: от 890 руб.'],
[20, 'Павильон №10. Выставочно-торговый центр Республики Молдова', 'В павильоне открыт магазин товаров для здоровья, одежды, а также ресторан европейской и национальной кухни «Leon». Возможно проведение мероприятий, банкетов. Имеются площадки для организации форумов и конгрессов.', [55.82966590205518,37.629477253660376], ['Ежедневно', '11:00—23:00'],'20', 'http://sobytiye.ru/wp-content/uploads/2020/03/degustacija.jpg',''],
[21, 'Павильон №68. Выставочно-торговый центр Республики Армения', 'С 2003 года в павильоне работает выставочно-коммерческий центр Республики Армения, где проходят тематические вечера и национальные праздники. В павильоне работает ресторан «Арарат», дегустационный зал, а также магазин армянских продуктов.', [55.83079512554391,37.633548846944976], ['Ежедневно', '10:00—20:00'],'20', 'https://storage.yandexcloud.net/moskvichmag/uploads/2019/07/DSC07862.jpg', ''],
[22, 'Шахматный клуб', 'В распоряжении гостей ВДНХ всесезонное деревянное строение площадью 400 кв. м. В универсальной игровой комнате установлено 12 деревянных столов с удобными скамейками. Играть здесь можно совершенно бесплатно.', [55.83276363963522,37.635716071829016], ['Ежедневно', '11:00—22:00'],'10', 'https://vdnh.ru/upload/resize_cache/iblock/e8d/1000_1000_1/e8d6689826c5068f3e6a660fa85862eb.jpg', ''],
[23, 'Дом культуры', 'Дом культуры — место проведения концертов, спектаклей, мастер-классов. На постоянной основе здесь работают вокальные коллективы, музыкальные и творческие студии, а также проводятся занятия по направлению хатха-йога. Проводятся мероприятия, подробнее:https://vdnh.ru/places/dom-kultury-vdnkh-stroenie-84/', [55.8333674582596,37.63453053544445], ['Ежедневно', '09:00—21:00'],'10', 'https://pin-place.com/images/2/11470.webp',''],
[24, 'Студия детских настольных игр Dodoland', 'Додо-дом — магазин добрых и экологичных настольных игр, конструкторов, игрушек и книг. Во все игры можно поиграть совершенно бесплатно и только потом принять решение о покупке. А еще там можно отметить день рождения или другой праздник, провести или посетить мастер-класс и поучаствовать в игротеке.', [55.83326696987275,37.632889521041925], ['Ежедневно', '11:00—19:00'],'10', 'https://vdnh.ru/upload/resize_cache/iblock/a41/1000_1000_1/a41b24353fed55c3145c291f33bb13f2.jpg', ''],
[25, 'Дом бабочек', 'В строении 519 работает «Баттерфляриум» — выставка живых тропических бабочек и музей коллекций насекомых со всего мира.',[55.8329556660787,37.63082309790256], ['Пн-Пт', '11:00—21:00','Сб-Вс', '10:00—21:00'],'30', 'https://butterflarium.ru/images/slider/slide-5.jpg', 'Детский билет (до 14 лет): 450 руб.Взрослый билет (с 14 лет): 550 руб.'],
[26, 'Павильон №44 «Кролиководство»', 'Этот павильон — один из самых удаленных на Выставке, он находится в северо-восточной части ВДНХ, за 4-м Каменским прудом. Неподалеку от здания, на открытом участке, можно было увидеть и самих кроликов разных пород: шиншилла, венский голубой, белый великан, ангорский, пуховый, белка, бабочка. При павильоне работали кролиководческая ферма и кормокухня.',[55.84059300991442,37.62544613484423], ['Ежедневно','11:00—22:00'],'20', 'https://nakr-impression.ru/wp-content/uploads/2019/05/IMG_3321-1360x765.jpg', ''],
[27, 'Павильон №67. Карелия', 'Павильон построен в 1954 году, архитекторы — Ф.И. Рехмуков, А.Я. Резниченко.', [55.830943794530086,37.632610770554194], ['Пн', 'Выходной','Вт—Вс', '11:00—22:00'],'20', 'https://avatars.mds.yandex.net/get-altay/367090/2a0000016287a006932eb1acdf6d634744bd/XXL', ''],
[28, 'Павильон №11. Выставочно-торговый центр Республики Казахстан', 'Гости павильона могут увидеть уникальные экспонаты казахской культуры, мультимедийные экспозиции о становлении государственности Республики Казахстан, ознакомиться с достижениями народного хозяйства и промышленности, узнать о выдающих казахских деятелях культуры, искусства и политики. Проходят мероприятия, подробнее: https://vdnh.ru/places/pavilon-11-metallurgiya-byvshiy-kazakhskaya-ssr-/', [55.83019241435647,37.62917242761902], ['Ежедневно', '11:00—20:00'],'20', 'https://photocentra.ru/images/main96/969955_main.jpg', ''],
[29, 'Павильон №12', 'Массивное здание облицовано светлым и темным мрамором. Сейчас здесь располагается Выставочный центр профсоюзов.', [55.83047114285057,37.62809026513384], ['Пн-Пт', '10:00—18:00', 'Сб-Вс', '10:00—19:00'],'5', 'https://www.zoofashion.ru/upload/medialibrary/45e/45e29dca1116089c7e9a0ee5700e9e7f.jpg',''],
[30, 'Строение 457', 'iTAB — территория здоровья — это постоянная выставка нутрицевтиков и натуральных экологичных товаров для здоровья, молодости и красоты.', [55.82988371831662,37.63513892352398], ['Пн', 'Выходной','Вт—Вс', '11:00—20:00'],'20', 'https://photos.wikimapia.org/p/00/00/44/33/26_big.jpg', ''],
[31, 'Павильон №14. Выставочно-торговый центр Азербайджанской Республики', 'В павильоне находится торгово-выставочный центр страны. Деятельность центра направлена на культурное и деловое представительство Азербайджана в России, развитие сотрудничества между странами. Проводятся мероприятия, подробнее: https://vdnh.ru/places/pavilon-14-vychislitelnaya-tekhnika-i-informatika-byvshiy-azerbaydzhanskaya-ssr-/', [55.831172408618315,37.62738142640165], ['Пн', 'Выходной','Вт—Вс', '11:00—19:00'],'20', 'https://um.mos.ru/upload/iblock/1a5/14%20%D0%BF%D0%B0%D0%B2_Skv_-8837.jpg', 'Экскурсии: от 500 руб.'],
[32, 'Павильон №18. Выставочно-торговый центр Республики Беларусь', 'В павильоне располагается торгово-выставочный центр Республики Беларусь, в котором представлены товары белорусских производителей. Проводятся мероприятия, подробнее: https://vdnh.ru/places/pavilon-18-respublika-belarus/', [55.83208236598132,37.62583362317902], ['Пн-Пт', '10:00—18:00','Сб-Вс', '10:00—19:00'],'20', 'http://s2.fotokto.ru/photo/full/628/6287768.jpg', ''],
[33, 'Павильон №17. Галерея «Лес»', 'В ходе небольшого интерактивного путешествия гости смогут узнать, что общего между человеком и деревом, как общаются деревья, поиграть в театр теней и лесную викторину, помочь олененку попасть к маме или вызвать Лешего.', [55.831415123713754,37.623977534540714], ['Ежедневно', '11:00—20:00'],'45', 'https://artmoskovia.ru/wp-content/uploads/2021/09/pavilon-lesnaya-promyshlennost-2021-god.-foto-press-sluzhby-vdnh-1.jpg', 'Взрослый билет: от 790 руб.Детский билет (3+): от 590 руб.Есть льготы.Есть доп.мероприятия'],
[34, 'Интерактивный музейный комплекс «Буран»', 'Внутри макета орбитального корабля «Буран БТС-001» расположен интерактивный музей — здесь можно не только посмотреть фильм о легендарном ракетоплане, но и управлять его посадкой на космодроме Байконур в режиме реального времени.', [55.83200084831169,37.62313532091003], ['Пн', 'Выходной','Вт—Вс', '11:00—20:00'],'20', 'https://avatars.dzeninfra.ru/get-zen_doc/1926321/pub_62b1bd5f20415000f47d2f2c_62b1cc86c1a3a6222a54609b/scale_1200', 'Взрослый билет: 300 руб.Льготный билет: 150 руб.'],
[35, 'Самолёт Як-42', 'Легендарный советский лайнер Як-42 был установлен на площади Промышленности ВДНХ в 1981 году. Борт СССР-42304 знаменит тем, что именно на нем установлен рекорд дальности беспосадочного перелета — 4730 километров, от Раменского до Читы.', [55.833801280937934,37.62309908444685], ['Ежедневно', '11:00—20:00'],'20', 'https://avatars.dzeninfra.ru/get-zen_doc/1886729/pub_5dc57cd72978bf375cfa49f7_5dc57cfef3cd8870191c374b/scale_1200', 'Взрослый билет: 900 руб.Детский билет: 500 руб.'],
[36, 'Вертолёт Ми-8', 'Вертолет Ми-8Т был способен перевозить до 24 человек и предназначался для высадки и эвакуации десанта, огневой поддержки сухопутных войск, а также транспортировки грузов.', [55.83407109958955,37.622298965485186], ['Ежедневно', '11:00—20:00'],'20', 'https://rostec.ru/upload/iblock/527/527211c6ccb7966d858824da8550140d.jpg', 'Взрослый билет: 900 руб.Детский билет: 500 руб.'],
[37, 'Макет ракеты-носителя «Восток»', 'Ракета-носитель «Восток» занимает особое место в истории отечественной космической программы, ведь именно этот аппарат 12 апреля 1961 года вывел на околоземную орбиту «Восток-1», на котором Юрий Гагарин совершил первый в истории Земли пилотируемый полет в космическое пространство.', [55.83432469599628,37.62309826377163], 'Круглосуточно','5', 'https://regnum.ru/uploads/pictures/news/2018/04/12/regnum_picture_15235389873767430_normal.JPG', ''],
[38, 'Павильон №26. Музей Транспорта Москвы', 'Экспозиция представляла коллекцию серийных автомобилей, прототипов «Москвичей» и гоночных болидов в кинематографическом жанре «байопик». На выставочной площади более 2 000 квадратных метров, в четырех залах выставки, как и в лучших традициях этого киножанра, посетители могли проследить путь автомобильной марки от съемок в главных советских фильмах и участия в международных ралли до закрытия завода.', [55.83432167700121,37.621537218124956], ['Пн', 'Выходной','Вт—Вс', '11:00—20:30'],'45', 'https://liveinmsk.ru/up/photos/album/vvc/9190.jpg', 'Стандартный билет: 400 руб.Льготный билет: 250 руб.'],
[39, 'Павильон №25 «Нефть»', 'Самая большая мультимедийная экспозиция о нефти в России тематически делится на 4 зала: «Человек и нефть», «История», «Технологии», «Наука». В оформлении центра использованы передовые технологические решения: виртуальная и дополненная реальность, голографический театр, а также современные phygital-решения на стыке цифрового и физического мира.(Запись на экскурсию заранее)', [55.83374806366633,37.61962212088834], ['Пн', 'Выходной','Вт—Пт','10:00—19:30','Сб-Вс', '11:00—20:30'],'45', 'https://rblogger.ru/img3/2020/pavilon-neft-kak-na-vdnh-sssr-tolko-luchshe/vdnh.-neft.-den-bez-turniketov.-15.02.20.03..jpg', ''],
[40, 'Павильон 21', 'По замечанию историка архитектуры А. Ю. Броновицкой, изогнутый козырек, нависающий над стеклянной стеной, — самый выразительный элемент главного фасада здания. Внимательные наблюдатели узнают в конструктиве принципы работы, которые популяризовал выдающийся французский зодчий ХХ века — Ле Корбюзье. Примечательно, что подобное решение не имеет аналогов в архитектуре Выставки.', [55.832338898125464,37.62052558990716], ['Ежедневно', '10:00—22:00'],'30', 'https://ex-forum.ru/wp-content/uploads/2022/03/pavilon-21-vdnh-2022.jpg', ''],
[41, 'Зелёный театр', 'Зеленый театр ВДНХ — легендарная площадка, место притяжения меломанов и театралов. Здесь — на сцене под открытым небом представлен разнообразный репертуар: от симфонических концертов и балета до выступлений современных рок-музыкантов.', [55.83155377401722,37.61753455587879], 'Круглосуточно','5', 'https://foxtime.ru/wp-content/uploads/2019/07/01.jpg', ''],
[42, 'Зал игp', 'Аллея залов находится в зоне Ландшафтного парка «Природа наук и искусств» — самой рукотворной части парка, где природа соединяется с современными архитектурными технологиями и создает уникальное рекреационное пространство.', '[55.83170834104921,37.61655532224115]', 'Круглосуточно','5', 'https://vdnh.ru/upload/resize_cache/iblock/40c/1000_1000_1/40cf228a12a749d98a365b785ea773f4.JPG', ''],
[43, 'Павильон «Книги»', 'Книжный клуб, открытый для каждого. Здесь можно отдохнуть за чтением, принять участие в дискуссиях и образовательных проектах, поделиться идеями за чашкой кофе в кафе «РОСИЗО».', [55.83012022613261,37.619930025004656], ['Ежедневно', '10:00—22:00'],'20', 'https://svao.mos.ru/about/%D0%BF%D0%B0%D0%B2%D0%B8%D0%BB%D1%8C%D0%BE%D0%BD%20%D0%BA%D0%BD%D0%B8%D0%B3%D0%B8_%D1%81%D0%B0%D0%B9%D1%82%20%D0%B2%D0%B4%D0%BD%D1%85_41-1024x683.jpg', ''],
[44, 'Павильон №31 «Геология»', 'Экспозиция выстроена как захватывающее повествование от лица ученых-биологов и современных художников о том, как все существующее на планете Земля, и даже за ее пределами, взаимосвязано друг с другом.', [55.83491186372321,37.61973961908643], ['Пн-Вт', 'Выходной','Ср—Вс', '11:00—18:00'],'30', 'https://www.np-ciz.ru/images/img_556185d43947c82ab14cb8d075539f21.jpg', 'Взрослый билет: 300 руб.Льготный билет: 150 руб.'],
[45, 'Музей «Биотех»', 'Посетители смогут взаимодействовать с экспонатами, участвовать в интерактивных викторинах и игровых объектах, однако даже такие развлечения будут насыщены полезной информацией, тщательно выверенной учеными.', [55.83513828424971,37.61873110849683], ['Пн-Вт', 'Выходной','Ср—Пт', '11:00—19:00','Сб-Вс', '12:00 — 20:00'],'60', 'https://artmoskovia.ru/wp-content/uploads/2022/05/1-4.jpg', 'Стандартный билет: 300 руб.Льготный билет: 150 руб.'],
[46, 'Памятник И.В. Мичурину', 'Русскому биологу и селекционеру, создателю многих сортов плодово-ягодных культур — находится сразу за Политехническим музеем. Его скульптор — Дмитрий Жилов.', [55.83446884344647,37.61672119257573], 'Круглосуточно','5', 'https://img-fotki.yandex.ru/get/4800/82260854.335/0_c58bf_753440d4_XXXL.jpg', ''],
[47, 'Павильон №29 Цветоводство', 'Интерактивное экспозиционно-выставочное пространство, где посетители могут познакомиться с объектами флоры и фауны вживую и посредством современных цифровых технологий.', [55.83575189027036,37.61819104311588], ['Пн', 'Выходной','Вт—Вс', '10:00—18:00'],'45', 'https://publishernews.ru/images/PressReleases/202001/press_r_0DEDF460-A0A2-40D1-8DD3-2A21635E3E6D-f.jpg', 'Билет: 200 руб.'],
[48, 'Храм-часовня святого Василия Великого', 'Святой Василий Великий, имя которого носит храм-часовня, жил в IV веке н.э., а своё имя — «Великий» — стал носить еще при жизни, так как был «ученым в двенадцати науках».', [55.83524453034097,37.61631621910046], ['Ежедневно', '10:00—17:00'],'10', 'https://img-fotki.yandex.ru/get/6827/41021914.57/0_9665e_8c1e6986_XL.jpg', ''],
[49, 'Sky Town. Верёвочный парк', ' Sky Town включает в себя различные виды препятствий, множество развлекательных элементов, смотровую площадку и детский паркур.', [55.83512185984576,37.61446962165398], ['Ежедневно','10:00—19:00'],'90', 'https://ic.pics.livejournal.com/oleg_bg/76602048/41437/41437_1000.jpg', 'Взрослый билет: от 1300 руб.Детский билет (до 17 лет, рост от 140 см): от 1000 руб.Детский паркур (рост от 110 до 140 см): от 800 руб.'],
[50, 'Павильон №28 «Пчеловодство»', 'В выставочном павильоне при помощи интерактивных экранов и тщательно отобранных экспонатов, перед вами развернется история пчеловодства: вы сможете познакомиться с орудиями труда пчеловода, различными видами ульев, породами пчел.', [55.83644725251039,37.616417783170526], ['Пн', 'Выходной','Вт—Вс','10:00—18:00'],'45', 'https://www.apiworld.ru/upload/iblock/8ec/8ec95a2953ad6166bd8056e0585035ad.jpg', 'Билет: 200 руб.'],
[51, 'Павильон №35. Главтабак', 'Павильон был построен по проекту художника В. С. Кондратьева к открытию послевоенной Выставки 1954 года. В настоящее время закрыт на комплексную реставрацию, после окончания работ здесь планируется открыть кафе. ', [55.838416389122074,37.614396078954854], 'Круглосуточно','5', 'https://pin-place.com/images/1/8083.webp', ''],
[52, 'Фонтан мальчик с рыбой', 'Позади павильона №64, воплощавшего собой символический образ колыбели Октябрьской революции — Ленинграда, расположен небольшой бассейн-фонтан со скульптурой Бориса Николаевича Сона «Рыбак», или «Мальчик с рыбой». ', [55.83309633516173,37.62963463814568], 'Круглосуточно','5', 'https://media.vdnh.ru/thumbs/ab/extlink_thumbs%252Faa%252Fall_files-2f42-2f4265_f63669cf2487bc1b8f737a11effdf7b9703f225e_preview.jpg_filePreview_.jpg_workDetails_0_.jpg', ''],
[53, '«Техноград». Инновационно-образовательный комплекс', 'Инновационно-образовательный комплекс «Техноград» — место, где можно освоить новую специальность, пройти профессиональную переподготовку, повысить свою квалификацию или получить базовые предпринимательские навыки.(Запись заранее)', [55.834915090608405,37.631976372352575], ['Ежедневно', '09:00—21:00'],'10', 'https://obruchev.mos.ru/%D0%B0%D0%BD%D0%BF%D0%B3%D1%80%D0%BE%D1%88%D0%BB0%D0%B7%D1%88%D1%89%D0%BB%D0%B4%D1%8C.jpg', ''],
[54, 'Умный город', 'Хотите узнать про Москву больше — добро пожаловать в павильон «Умный город». Совершить виртуальную прогулку по павильону вам поможет 3D-тур.( Запись на экскурссию заранее)', [55.83400507080658,37.630873818710], ['Пн', 'Выходной','Вт—Вс', '10:00—20:00'],'60', 'http://itd0.mycdn.me/image?id=884910010421&t=20&plc=WEB&tkn=*2ftXbvHauNjqgR63n7IVNq00mKA', ''],
[55, 'Летний кинотеатр-лекторий', 'Летние вечера в кинотеатре — это свежий воздух, хорошие фильмы и приятная компания. Здесь нет ограничений в виде подлокотников кресла: можно удобно сесть, уютно укутаться в плед и насладиться особой атмосферой.', [55.835684967923974,37.62801699877306], 'Круглосуточно', '5','https://kinohod.ru/o/99/5a/995a4f74-f1cf-4313-81ed-64a43411a86c.jpg', ''],
[56, 'Памятный знак «Работникам ВСХВ, погибшим на фронтах Великой Отечественной войны 1941-1945 гг.»', 'На одной части бронзового изваяния мы видим традиционную верхнюю одежду времен Отечественной войны — фуражку и куртку — и ручной инструмент для работы. На другой — рельефное изображение солдат у зенитной пушки на фоне павильона «Рабочий и колхозница».', [55.83450477930768,37.62487024855989], 'Круглосуточно','5', 'https://www.mos.ru/upload/newsfeed/newsfeed/otkritie-pamyatnogo-znaka_AC(9).jpg', ''],
[57, 'Истребитель Су-27', 'Сегодня у вас появилась уникальная возможность поближе познакомиться с легендарным советским и российским многоцелевым всепогодным сверхзвуковым тяжелым истребителем четвертого поколения Су-27, предназначенным для завоевания превосходства в воздухе.', [55.834794600391135,37.6233413894214], ['Ежедневно', '11:00—20:00'],'20', 'https://img-fotki.yandex.ru/get/26352/355089976.9/0_fcab8_4772e466_XXL.jpg', 'Взрослый билет: 900 рублей.Детский билет: 500 рублей.'],
[58, 'Павильон №55. Музей оптических иллюзий', 'В павильоне №55 на ВДНХ находятся семейные развлекательные музеи Big Creative — компании, создающей самые неординарные развлечения по всему миру.', [55.83505121099821,37.62339503360171], ['Ежедневно', '10:00—21:00'],'60', 'https://vdnh.ru/upload/resize_cache/iblock/e38/1000_1000_1/e388004e8c3fbdd09f71e765b797ce35.jpg', '1 из 11 музеев на выбор: 700 руб.5 из 11 музеев на выбор: 1700 руб. 11 музеев и аттракционов: 2700 руб.'],
[59, 'Дом ремёсел', 'Мастерские располагают всем необходимым оборудованием для работы и инфраструктурой для общения и обучения. Здесь можно не только арендовать инвентарь и получить консультацию специалистов, но и поучаствовать в мастер-классах и пообщаться с единомышленниками. Также мастерские работают как коворкинг, образовательная площадка, пространство для мероприятий и база для реализации коммерческих проектов.', [55.837270810446476,37.6241431685712], ['Ежедневно', '10:00-22:00'],'60' ,'https://avatars.dzeninfra.ru/get-zen_doc/163240/pub_62e90d81cd1c6b24fec311cc_62e90e67a76be617e7751c15/scale_1200', ''],
[60, 'Павильон №33', 'Павильон строился для проведения машиностроительных выставок, которые регулярно проходили на ВДНХ СССР. В павильоне демонстрировались новейшие достижения советского автопрома и его отраслевая продукция.', [55.83579467317606,37.621607066795384], ['Ежедневно', '11:00—22:00'],'30', 'http://img-fotki.yandex.ru/get/5800/synthart.2c/0_3d8b9_2c76c26b_XL', 'Цены зависят от мероприятия, подробности: https://vdnh.ru/places/pavilon-33/'],
[61, 'Гаража особого назначения ФСО России', 'В музее представлены легендарные машины лидеров Российской империи, Советского Союза и Российской Федерации.', [55.83595467350419,37.622379542991666], ['Пн', 'Выходной','Вт—Вс', '11:00—20:00'],'30', 'https://a.d-cd.net/8UDSaqDN0EftPfnqSt9kbr4BeDU-1920.jpg', 'Входной билет: от 550 руб.Льготный билет: от 300 руб.'],
[62, 'Центр национальных конных традиций', 'Центр национальных конных традиций – это уникальная площадка мирового уровня для демонстрации конного достояния России, где гармонично сочетается спорт, культура, образование, коневодство и туризм.', [55.83827921235873,37.623388367754984], ['Пн', 'Выходной','Вт—Вс', '11:00—20:00'],'30', 'https://i.timeout.ru/pix/441731.jpeg', 'Стандарт: от 560.Есть льготы'],
[63, 'Городская ферма', 'Не покидая пределов Москвы, здесь в любую погоду можно скрыться от городской суеты и познакомиться с фермерской жизнью, традициями и симпатичными, ухоженными обитателями, наполнить день радостью творчества на семейном мастер-классе или оценить обеденное меню в кафе «Ферма».', [55.840198954853165,37.627411094392876], ['Пн-Пт', '10:30—19:00','Сб-Вс', '10:30—20:00'],'30', 'https://madeinfuture.ru/img/174/ferma-vdnh2.jpg', 'Пн-Пт: от 600 руб.Есть льготы']]
function distance(a){ 
  var d=[] 
  for (let i=0; i < a.length;i++){
    d.push(a[i][3])
  }
  var Dict = new Array(a.length)
  for ( let j = 0; j < a.length; j++) {
       Dict[j]=new Array()
      for (z=0; z<a.length; z++){
        Dict[j][z]=0
      }
  }
  for (let k=0; k < Dict.length;k++){
    for (let t=0; t < Dict.length;t++){
      var r=d[t]
      var b=d[k]
      lj=(b[0]-r[0])*111.1
      let xz=(b[1]-r[1])*111.1
      let u=Math.sqrt(xz**2+lj**2)
      if (k!=t){
        Dict[k][t]=Math.round(u*1000)
        Dict[t][k]=Math.round(u*1000)
      }else{
        Dict[k][t]=0
      }
    }
  }
  return Dict 
}
function TimeOclock(Time,TimeAll){
  var week=['Пн','Вт','Ср','Чт','Пт','Сб','Вс']
  let t=String(Time[1])
  let Times = 0
  let times = Number(t.slice(0, 2)) * 60 + Number(t.slice(3, 5))
  if (TimeAll[4]=='Круглосуточно'){
    return 10000
  }else{
  if (TimeAll[4][0]=='Ежедневно'){
    Times=TimeAll[4][1]
    let time1 = Number(Times.slice(0, 2)) * 60 + Number(Times.slice(3, 5)) 
    let time2 = Number(Times.slice(6, 8)) * 60 + Number(Times.slice(9, 11))
    console.log(time1, time2, times,times+60)
    if (((time1 <= times) && (times <= time2))||((time1 <= times+60) && (times <= time2))){
      return time2 - times
    }else{
      if(time2 - times<0){
      return time2 - times
    }else{
      return false
    }
    }
  }else{
  let indices = TimeAll[4].indexOf(Time[0])
  if (indices!=-1){
  let indicesTime = indices+1
  Times = TimeAll[4][indicesTime]
  if (Times=='Выходной'){
    return false
  } else{
    let time1 = Number(Times.slice(0, 2)) * 60 + Number(Times.slice(3, 5)) 
    let time2 = Number(Times.slice(6, 8)) * 60 + Number(Times.slice(9, 11))
    if (((time1 <= times) && (times <= time2))||((time1 <= times+60) && (times <= time2))){
      return time2 - times
    }else{
      if(time2 - times<0){
      return time2 - times
    }else{
      return false
    }
    }
  }
  }else{
    var doki=[]
  for (let i=0;i<(TimeAll[4].length);i++){
    if (TimeAll[4][i].length==5){
      doki.push(TimeAll[4][i])
    }
  }
  for(let j=0;j<doki.length;j++){
    var today=[]
    let vax = TimeAll[4].indexOf(doki[j])
    let tryd=doki[j]
    day_one=String(tryd.slice(0, 2))
    day_two=String(tryd.slice(3, 5))
    let indices_1 = week.indexOf(day_one)
    let indices_2 = week.indexOf(day_two)
    let raz=indices_2-indices_1+1
    let indicesx=indices_1
    for (let h=0; h<raz;h++){
      today.push(week[indicesx])
      indicesx=indicesx+1
    }
    if (today.indexOf(Time[0])!=-1){
      Times=TimeAll[4][vax+1]
    }
  }
  let time1 = Number(Times.slice(0, 2)) * 60 + Number(Times.slice(3, 5)) 
    let time2 = Number(Times.slice(6, 8)) * 60 + Number(Times.slice(9, 11))
    if (((time1 <= times) && (times <= time2))||((time1 <= times+60) && (times <= time2))){
      return time2 - times
    }else{
      if(time2 - times<0){
      return time2 - times
    }else{
      return false
    }
    }
  }
}
}
}
function alerted(){
	var checked = [];
	$('input:checkbox:checked').each(function() {
	checked.push($(this).val());
	});
	console.log(checked)
	var fs=[]
	for(let i=0;i<checked.length;i++){
		let t = checked[i]-1
		fs.push(ltry[t])
	}
	var TmeOut=[]
	var TmeWork=[]
	var TmeNov=[]
	let Time_Right=0
	for (let i=0;i<fs.length;i++){
  let Time_Now=['Сб','06:20']
  let Timers=fs[i]
  Time_Right=TimeOclock(Time_Now,Timers)
  if (Time_Right<0){
    TmeOut.push(fs[i][0])
  } else if (Time_Right==false){
    TmeNov.push(fs[i][0])
  }else{
  TmeWork.push(fs[i][0])
  TmeWork.push(Time_Right)
}
}
console.log('Work',TmeWork)
console.log('Out',TmeOut)
console.log('Now',TmeNov)
fs.unshift(['','','',[55.82626315161884,37.63755969721379]])
	var a=distance(fs)
	let s = a.length
	let A = 1
	let B = 1.4
	let ji = 0.64 
	var d = []
	let Ages = 150
	let q = 8
	let ant=25
  let rig=true
	let mnTrass = 1000000000000
	var bestT = []
	var lktr= []
	var mas = new Array(s);
	for (var i = 0; i < mas.length; i++) {
		mas[i] = new Array();
		for (j=0; j<s; j++){
			mas[i][j]=0.2;
		}
	}
  if ((TmeNov.length==0)&&(TmeOut.length==0)){
    if (rig){
	for (let fg=0; fg<Ages;fg++){
		var td = new Array(ant)
		for (var i = 0; i < ant; i++) {
			td[i]=new Array();
			for (j=0; j<s; j++){
				td[i][j]=0;
			}
		}
		for (let o=0; o<ant;o++){
			var kf = []
			var antROUTE=[]
			let from_city=0
			antROUTE.push(from_city)
			var Zero = new Array(s)
			for (var i = 0; i < s; i++) {
				Zero[i]=new Array()
				for (j=0; j<s; j++){
					Zero[i][j]=0;
				}
			}
			for (let k=0; k<s;k++){
				let Sum = 0 
				
				for (let lfg=0; lfg<a[from_city].length;lfg++){
					if (antROUTE.indexOf(lfg)==-1){
						Sum=Sum+((10000-a[from_city][lfg])**B*(mas[from_city][lfg])**A)
					}
				}
				kf.push(Sum)
				for (let j=0; j<a[from_city].length;j++){
					if (antROUTE.indexOf(j)==-1){
						let lk=(10000-a[from_city][j])**B*(mas[from_city][j])**A
						if (kf[k]!=0){
							Zero[from_city][j]=lk/kf[k]
						}else{
							Zero[from_city][j]=1
						}
					}
				}
				if (antROUTE.length!=s){
					let isNotChosen = true
                                        while (isNotChosen){
						var rand = Math.random()
						for (p=0;p<Zero[from_city].length;p++){
							if (Zero[from_city][p] >= rand){
								let indexi=0
								for (i=0;i<Zero[from_city].length;i++){
									if (Zero[from_city][p]==Zero[from_city][i]){
										indexi=i
									}
								}
								td[o][k+1]=indexi
								from_city=indexi
								antROUTE.push(from_city)
								isNotChosen = false
								break
							}
						}
					}
				}
			}
		}
		for (ih=0;ih<mas.length;ih++){
			for (jh=0;jh<mas[ih].length;jh++){
				mas[ih][jh]=mas[ih][jh]*ji
			}
		}
		for (i=0;i<(td.length-1);i++){
			let dsd=0
                        var Trass=[]
                        var TimeWR=[]
                        let TimeW=0
                        for (j=0;j<(td[i].length-1);j++){
				Trass.push(td[i][j])
                                if (td[i][j+1]==td[i][s-1]){
					Trass.push(td[i][j+1])
				}
				fr=td[i][j]
				fr1=td[i][j+1]
                                dsd=dsd+a[fr][fr1]
			}
                        let tic=dsd/50*60
                        TimeW=tic
                        TimeWR.push(TimeW)
                        let Sumr=0
                        for (yt=0; yt<TimeWR.lenght; yt++){
				Sumr=Sumr+TimeWR[yt]
			}
                        if  (dsd<mnTrass){
				mnTrass=dsd
				bestT=Trass             
			}
                        let L=q/dsd
                        for (klo=0;klo<(td[i].length);klo++){
				//if (Sumr<=TimeOclock(TimeAll,Time)){
				mas[fr][fr1]=mas[fr][fr1]+L
                                mas[fr1][fr]=mas[fr1][fr]+L
			//}
			}
		}
	}
	console.log(mnTrass, bestT,TimeWR)
	for (let okl=0;okl<s;okl++){
		lktr.push(fs[bestT[okl]][3])
	
        }
	console.log(lktr) 
    // Создание экземпляра маршрута.
	ymaps.ready(function () {
    // Построение маршрута на общественном транспорте.
    let mymap = new ymaps.Map('map', {
        center: [55.751574, 37.573856],
        zoom: 18,
        controls: ['largeMapDefaultSet']
    });
    let multiRoute = new ymaps.multiRouter.MultiRoute({
        referencePoints: lktr,
        params: {
            // Тип маршрута: на общественном транспорте.
            routingMode: "masstransit"  
        }
    }, {
        // Автоматически устанавливать границы карты так,
        // чтобы маршрут был виден целиком.
        boundsAutoApply: true
    });

    // Добавление маршрута на карту.
    mymap.geoObjects.add(multiRoute);
		})
  }else{
    console.log(56)
  }
  }
  if (TmeOut.length!=0) {
 //if (confirm('Данные точки уже закрыты:'+ TmeOut + 'Всё-ровно построить маршрут?')){
	if (rig==true){
	  for (let fg=0; fg<Ages;fg++){
		var td = new Array(ant)
		for (var i = 0; i < ant; i++) {
			td[i]=new Array();
			for (j=0; j<s; j++){
				td[i][j]=0;
			}
		}
		for (let o=0; o<ant;o++){
			var kf = []
			var antROUTE=[]
			let from_city=0
			antROUTE.push(from_city)
			var Zero = new Array(s)
			for (var i = 0; i < s; i++) {
				Zero[i]=new Array()
				for (j=0; j<s; j++){
					Zero[i][j]=0;
				}
			}
			for (let k=0; k<s;k++){
				let Sum = 0 
				
				for (let lfg=0; lfg<a[from_city].length;lfg++){
					if (antROUTE.indexOf(lfg)==-1){
						Sum=Sum+((10000-a[from_city][lfg])**B*(mas[from_city][lfg])**A)
					}
				}
				kf.push(Sum)
				for (let j=0; j<a[from_city].length;j++){
					if (antROUTE.indexOf(j)==-1){
						let lk=(10000-a[from_city][j])**B*(mas[from_city][j])**A
						if (kf[k]!=0){
							Zero[from_city][j]=lk/kf[k]
						}else{
							Zero[from_city][j]=1
						}
					}
				}
				if (antROUTE.length!=s){
					let isNotChosen = true
                                        while (isNotChosen){
						var rand = Math.random()
						for (p=0;p<Zero[from_city].length;p++){
							if (Zero[from_city][p] >= rand){
								let indexi=0
								for (i=0;i<Zero[from_city].length;i++){
									if (Zero[from_city][p]==Zero[from_city][i]){
										indexi=i
									}
								}
								td[o][k+1]=indexi
								from_city=indexi
								antROUTE.push(from_city)
								isNotChosen = false
								break
							}
						}
					}
				}
			}
		}
		for (ih=0;ih<mas.length;ih++){
			for (jh=0;jh<mas[ih].length;jh++){
				mas[ih][jh]=mas[ih][jh]*ji
			}
		}
		for (i=0;i<(td.length-1);i++){
			let dsd=0
                        var Trass=[]
                        var TimeWR=[]
                        let TimeW=0
                        for (j=0;j<(td[i].length-1);j++){
				Trass.push(td[i][j])
                                if (td[i][j+1]==td[i][s-1]){
					Trass.push(td[i][j+1])
				}
				fr=td[i][j]
				fr1=td[i][j+1]
                                dsd=dsd+a[fr][fr1]
			}
                        let tic=dsd/50*60
                        TimeW=tic
                        TimeWR.push(TimeW)
                        let Sumr=0
                        for (yt=0; yt<TimeWR.lenght; yt++){
				Sumr=Sumr+TimeWR[yt]
			}
                        if  (dsd<mnTrass){
				mnTrass=dsd
				bestT=Trass             
			}
                        let L=q/dsd
                        for (klo=0;klo<(td[i].length);klo++){
				//if (Sumr<=TimeOclock(TimeAll,Time)){
				mas[fr][fr1]=mas[fr][fr1]+L
                                mas[fr1][fr]=mas[fr1][fr]+L
			//}
			}
		}
	}
	console.log(mnTrass, bestT,TimeWR)
	for (let okl=0;okl<s;okl++){
		lktr.push(fs[bestT[okl]][3])
	
        }
	console.log(lktr) 
    // Создание экземпляра маршрута.
	ymaps.ready(function () {
    // Построение маршрута на общественном транспорте.
    let mymap = new ymaps.Map('map', {
        center: [55.751574, 37.573856],
        zoom: 18,
        controls: ['largeMapDefaultSet']
    });
    let multiRoute = new ymaps.multiRouter.MultiRoute({
        referencePoints: lktr,
        params: {
            // Тип маршрута: на общественном транспорте.
            routingMode: "masstransit"  
        }
    }, {
        // Автоматически устанавливать границы карты так,
        // чтобы маршрут был виден целиком.
        boundsAutoApply: true
    });

    // Добавление маршрута на карту.
    mymap.geoObjects.add(multiRoute);
		})
  }else{
    console.log(56)
  }
  }
	 if (TmeNov.length!=0) {
 //if (confirm('Данные точки уже закрыты:'+ TmeOut + 'Всё-ровно построить маршрут?')){
	if (rig==true){
	  for (let fg=0; fg<Ages;fg++){
		var td = new Array(ant)
		for (var i = 0; i < ant; i++) {
			td[i]=new Array();
			for (j=0; j<s; j++){
				td[i][j]=0;
			}
		}
		for (let o=0; o<ant;o++){
			var kf = []
			var antROUTE=[]
			let from_city=0
			antROUTE.push(from_city)
			var Zero = new Array(s)
			for (var i = 0; i < s; i++) {
				Zero[i]=new Array()
				for (j=0; j<s; j++){
					Zero[i][j]=0;
				}
			}
			for (let k=0; k<s;k++){
				let Sum = 0 
				
				for (let lfg=0; lfg<a[from_city].length;lfg++){
					if (antROUTE.indexOf(lfg)==-1){
						Sum=Sum+((10000-a[from_city][lfg])**B*(mas[from_city][lfg])**A)
					}
				}
				kf.push(Sum)
				for (let j=0; j<a[from_city].length;j++){
					if (antROUTE.indexOf(j)==-1){
						let lk=(10000-a[from_city][j])**B*(mas[from_city][j])**A
						if (kf[k]!=0){
							Zero[from_city][j]=lk/kf[k]
						}else{
							Zero[from_city][j]=1
						}
					}
				}
				if (antROUTE.length!=s){
					let isNotChosen = true
                                        while (isNotChosen){
						var rand = Math.random()
						for (p=0;p<Zero[from_city].length;p++){
							if (Zero[from_city][p] >= rand){
								let indexi=0
								for (i=0;i<Zero[from_city].length;i++){
									if (Zero[from_city][p]==Zero[from_city][i]){
										indexi=i
									}
								}
								td[o][k+1]=indexi
								from_city=indexi
								antROUTE.push(from_city)
								isNotChosen = false
								break
							}
						}
					}
				}
			}
		}
		for (ih=0;ih<mas.length;ih++){
			for (jh=0;jh<mas[ih].length;jh++){
				mas[ih][jh]=mas[ih][jh]*ji
			}
		}
		for (i=0;i<(td.length-1);i++){
			let dsd=0
                        var Trass=[]
                        var TimeWR=[]
                        let TimeW=0
                        for (j=0;j<(td[i].length-1);j++){
				Trass.push(td[i][j])
                                if (td[i][j+1]==td[i][s-1]){
					Trass.push(td[i][j+1])
				}
				fr=td[i][j]
				fr1=td[i][j+1]
                                dsd=dsd+a[fr][fr1]
			}
                        let tic=dsd/50*60
                        TimeW=tic
                        TimeWR.push(TimeW)
                        let Sumr=0
                        for (yt=0; yt<TimeWR.lenght; yt++){
				Sumr=Sumr+TimeWR[yt]
			}
                        if  (dsd<mnTrass){
				mnTrass=dsd
				bestT=Trass             
			}
                        let L=q/dsd
                        for (klo=0;klo<(td[i].length);klo++){
				//if (Sumr<=TimeOclock(TimeAll,Time)){
				mas[fr][fr1]=mas[fr][fr1]+L
                                mas[fr1][fr]=mas[fr1][fr]+L
			//}
			}
		}
	}
	console.log(mnTrass, bestT,TimeWR)
	for (let okl=0;okl<s;okl++){
		lktr.push(fs[bestT[okl]][3])
	
        }
	console.log(lktr) 
    // Создание экземпляра маршрута.
	ymaps.ready(function () {
    // Построение маршрута на общественном транспорте.
    let mymap = new ymaps.Map('map', {
        center: [55.751574, 37.573856],
        zoom: 18,
        controls: ['largeMapDefaultSet']
    });
    let multiRoute = new ymaps.multiRouter.MultiRoute({
        referencePoints: lktr,
        params: {
            // Тип маршрута: на общественном транспорте.
            routingMode: "masstransit"  
        }
    }, {
        // Автоматически устанавливать границы карты так,
        // чтобы маршрут был виден целиком.
        boundsAutoApply: true
    });

    // Добавление маршрута на карту.
    mymap.geoObjects.add(multiRoute);
		})
  }else{
    console.log(56)
  }
  }
}
